resilencelyn/gitee/open-skyeye/code/device/spiSimulateDevice/rm48x_spi/rm48x_spi.c
#include <skyeye_lock.h>
#include <skyeye_types.h>
#include <skyeye_sched.h>
#include <skyeye_signal.h>
#include <skyeye_class.h>
#include <skyeye_interface.h>
#include <skyeye_iface.h>
#include <skyeye_obj.h>
#include <skyeye_mm.h>
#include <memory_space.h>
#include <skyeye_device.h>
#include <skyeye_core.h>
#include <skyeye_signal.h>
#define DEBUG
#include <skyeye_log.h>
#include "rm48x_spi.h"

#define SET_BIT(reg, mask) ((reg) |= (mask))
#define CLR_BIT(reg, mask) ((reg) &= ~(mask))
#define CHK_BIT(reg, mask) ((reg) & (mask))

static void assert_cs_line(conf_object_t *opaque)
{
	rm48x_spi_device *dev = opaque->obj;
	conf_object_t *slave_obj;
	spi_device_intf *spi_dev_iface;

	slave_obj = dev->slaves[dev->index].slave_obj;
	spi_dev_iface = dev->slaves[dev->index].spi_dev_iface;

	if (spi_dev_iface && slave_obj)
		spi_dev_iface->spi_assert_cs_line(slave_obj);
}

static void deassert_cs_line(conf_object_t *opaque)
{
	rm48x_spi_device *dev = opaque->obj;
	conf_object_t *slave_obj;
	spi_device_intf *spi_dev_iface;

	slave_obj = dev->slaves[dev->index].slave_obj;
	spi_dev_iface = dev->slaves[dev->index].spi_dev_iface;

	if (spi_dev_iface && slave_obj)
		spi_dev_iface->spi_deassert_cs_line(slave_obj);
}

static uint32_t get_format_reg(conf_object_t *opaque)
{
	rm48x_spi_device *dev = opaque->obj;

	/* slave mode only support spifmt0 */
	if ((dev->regs.spigcr1 & 0x3) == 0x0)
		return dev->regs.spifmt0;

	switch ((dev->regs.spidat1 >> 24) & 0x3) {
		case 0: return dev->regs.spifmt0;
		case 1: return dev->regs.spifmt1;
		case 2: return dev->regs.spifmt2;
		case 3: return dev->regs.spifmt3;
	}
	return 0;
}

static int get_data_length(uint32_t spifmt)
{
	int len;

	len = spifmt & 0x1f;
	len = len < 2 ? 8 : len > 16 ? 16 : len;
	return len;
}

static int send_data_to_spi_device(conf_object_t *opaque, uint32_t spidat)
{
	rm48x_spi_device *dev = opaque->obj;
	uint32_t spifmt, data;
	int len;
	char *p = (char *)&spidat;
	conf_object_t *slave_obj = dev->slaves[dev->index].slave_obj;
	spi_device_intf *spi_dev_iface = dev->slaves[dev->index].spi_dev_iface;

	spifmt = get_format_reg(opaque);
	len = get_data_length(spifmt);

	if (slave_obj && spi_dev_iface) {
		spi_dev_iface->spi_device_receive(slave_obj, p, len / 8);
	}
	return 0;
}

static void check_cs_line(conf_object_t *opaque)
{
	rm48x_spi_device *dev = opaque->obj;
	conf_object_t *slave_obj;
	spi_device_intf *spi_dev_iface;

	/* if CSHOLD bit is zero, then deassert cs line */
	if ((dev->regs.spidat1 & (1 << 28)) == 0) {
		slave_obj = dev->slaves[dev->index].slave_obj;
		spi_dev_iface = dev->slaves[dev->index].spi_dev_iface;

		if (spi_dev_iface && slave_obj)
			spi_dev_iface->spi_deassert_cs_line(slave_obj);
	}
}

static int start_transmit(conf_object_t *opaque, uint32_t spidat)
{
	rm48x_spi_device *dev = opaque->obj;
	RW_WRLOCK(dev->lock);
	dev->regs.spiflg &= ~(1 << 9);
	dev->regs.intvect1 = 0;
	RW_UNLOCK(dev->lock);
	
	if ((dev->regs.spigcr1 & 0x3) == 0x3) {
		/* master mode, spidata & 0xff is real data, begin
		 * transmit here we should get data length and dir
		 */
		/* enable cs line */
		assert_cs_line(opaque);
		/* send data to spi device */
		send_data_to_spi_device(opaque, spidat);
		/* after transmit data, we diasble cs line by cshold */
		check_cs_line(opaque);
		if (dev->regs.spiint0 & (1 << 9)) {
			/* raise signal */
			RW_WRLOCK(dev->lock);
			dev->regs.spiflg |= 1 << 9;
			dev->regs.intvect1 = 0x14 << 1;
			RW_UNLOCK(dev->lock);

			if (dev->signal_iface != NULL) {
				dev->signal_iface->signal(dev->signal, dev->interrupt_number);
			}
		}
	} else {
		/* FIXME:slave mode */
		/* spidata & 0xff is real data, begin transmit */
		if (dev->regs.spiint0 & (1 << 9)) {
			//dbg_spi_data(opaque, spidat);
			/* raise signal */
			RW_WRLOCK(dev->lock);
			dev->regs.spiflg |= 1 << 9;
			dev->regs.intvect1 = 0x14 << 1;
			RW_UNLOCK(dev->lock);

			if (dev->signal_iface != NULL) {
				dev->signal_iface->signal(dev->signal, dev->interrupt_number);
			}
		}
	}
}

static int notify_transmit_done(conf_object_t *opaque)
{
	rm48x_spi_device *dev = opaque->obj;
	conf_object_t *slave_obj = dev->slaves[dev->index].slave_obj;
	spi_device_intf *spi_dev_iface = dev->slaves[dev->index].spi_dev_iface;

	if (slave_obj && spi_dev_iface)
		spi_dev_iface->spi_device_receive_done(slave_obj);
	return 0;
}

static int get_slave_index(uint32_t spidef)
{
	int i;

	for (i = 0; i < 8; i++) {
		if (spidef & (1 << i))
			return i;
	}
}

static exception_t MibSPI_RAM_read(conf_object_t *opaque, generic_address_t offset, void *buf, size_t count)
{
	rm48x_spi_device *dev = opaque->obj;
	
	return 0;
}

static exception_t MibSPI_RAM_write(conf_object_t *opaque, generic_address_t offset, void *buf, size_t count)
{
	rm48x_spi_device *dev = opaque->obj;
	uint32_t val = *(uint32_t *)buf;
	
	return 0;
}

static exception_t rm48x_spi_read(conf_object_t *opaque, generic_address_t offset, void *buf, size_t count)
{
	rm48x_spi_device *dev = opaque->obj;
	static int offset2 = 0;
	switch (offset)
	{
		case SPIGCR0:
			*(uint32_t *)buf = dev->regs.spigcr0;
			break;
		case SPIGCR1:
			*(uint32_t *)buf = dev->regs.spigcr1;
			break;
		case SPIINT0:
			*(uint32_t *)buf = dev->regs.spiint0;
			break;
		case SPILVL:
			*(uint32_t *)buf = dev->regs.spilvl;
			break;
		case SPIFLG:
			*(uint32_t *)buf = dev->regs.spiflg;
			break;
		case SPIPC0:
			*(uint32_t *)buf = dev->regs.spipc0;
			break;
		case SPIPC1:
			*(uint32_t *)buf = dev->regs.spipc1;
			break;
		case SPIPC2:
			*(uint32_t *)buf = dev->regs.spipc2;
			break;
		case SPIPC3:
			*(uint32_t *)buf = dev->regs.spipc3;
			break;
		case SPIPC4:
			*(uint32_t *)buf = dev->regs.spipc4;
			break;
		case SPIPC5:
			*(uint32_t *)buf = dev->regs.spipc5;
			break;
		case SPIPC6:
			*(uint32_t *)buf = dev->regs.spipc6;
			break;
		case SPIPC7:
			*(uint32_t *)buf = dev->regs.spipc7;
			break;
		case SPIPC8:
			*(uint32_t *)buf = dev->regs.spipc8;
			break;
		case SPIDAT0:
			*(uint32_t *)buf = dev->regs.spidat0;
			break;
		case SPIDAT1:
			*(uint32_t *)buf = dev->regs.spidat1;
			break;
		case SPIBUF:
			//int rx_data = dev->regs.spibuf & 0xffff;

			if ((dev->regs.mibspie) & 0x1 == 1)
			{
				dev->regs.spibuf = dev->MibSPI_RAM.TxRAM[offset2];
				offset2 = offset2 + 4;
				if (offset2 >= 0x80)
					offset2 = 0;
				*(uint32_t *)buf = dev->regs.spibuf;
				dev->regs.spiflg &= ~(1 << 8);
			
			}else {
				if (CheckCanReadNum(dev->spi_fifo) > 0) {
				char ch;

				ReadFIFO(dev->spi_fifo, &ch, 1);

				dev->regs.spibuf &= ~0xffff;
				dev->regs.spibuf |= 0xff & ch;

