resilencelyn/gitee/open-skyeye/code/device/spiSimulateDevice/rm48x_spi/rm48x_spi.c
				*(uint32_t *)buf = dev->regs.spibuf;
				if (CheckCanReadNum(dev->spi_fifo) <= 0)
					dev->regs.spiflg &= ~(1 << 8);
				} else {
					*(uint32_t *)buf = dev->regs.spibuf;
					dev->regs.spiflg &= ~(1 << 8);
				}
				
			}
			
			break;
		case SPIEMU:
			*(uint32_t *)buf = dev->regs.spiemu;
			break;
		case SPIDELAY:
			*(uint32_t *)buf = dev->regs.spidelay;
			break;
		case SPIDEF:
			*(uint32_t *)buf = dev->regs.spidef;
			break;
		case SPIFMT0:
			*(uint32_t *)buf = dev->regs.spifmt0;
			break;
		case SPIFMT1:
			*(uint32_t *)buf = dev->regs.spifmt1;
			break;
		case SPIFMT2:
			*(uint32_t *)buf = dev->regs.spifmt2;
			break;
		case SPIFMT3:
			*(uint32_t *)buf = dev->regs.spifmt3;
			break;
		case INTVECT0:
			*(uint32_t *)buf = dev->regs.intvect0;
			break;
		case INTVECT1:
			*(uint32_t *)buf = dev->regs.intvect1;
			if (((dev->regs.intvect1 >> 1) & 0x1f) == 0x12)
			{
				dev->regs.spiflg &= ~(1 << 8);
				dev->regs.spiflg &= ~(1 << 6);
			}
			break;
		case SPIPC9:
			*(uint32_t *)buf = dev->regs.spipc9;
			break;
		case SPIPMCTRL:
			*(uint32_t *)buf = dev->regs.spipmctrl;
			break;
		case MIBSPIE:
			*(uint32_t *)buf = dev->regs.mibspie;
			break;
		case TGITENST:
			*(uint32_t *)buf = dev->regs.tgitenst;
			break;
		case TGITENCR:
			*(uint32_t *)buf = dev->regs.tgitencr;
			break;
		case TGITLVST:
			*(uint32_t *)buf = dev->regs.tgitlvst;
			break;
		case TGITLVCR:
			*(uint32_t *)buf = dev->regs.tgitlvcr;
			break;
		case TGINTFLG:
			*(uint32_t *)buf = dev->regs.tgintflg;
			break;
		case TICKCNT:
			*(uint32_t *)buf = dev->regs.tickcnt;
			break;
		case LTGPEND:
			*(uint32_t *)buf = dev->regs.ltgpend;
			break;
		case TGXCTRL:
			*(uint32_t *)buf = dev->regs.tgxctrl;
			break;
		case DMAXCTRL:
			*(uint32_t *)buf = dev->regs.dmaxctrl;
			break;
		case ICOUNT:
			*(uint32_t *)buf = dev->regs.icount;
			break;
		case DMACNTLEN:
			*(uint32_t *)buf = dev->regs.dmacntlen;
			break;
		case UERRCTRL:
			*(uint32_t *)buf = dev->regs.uerrctrl;
			break;
		case UERRSTAT:
			*(uint32_t *)buf = dev->regs.uerrstat;
			break;
		case UERRADDR1:
			*(uint32_t *)buf = dev->regs.uerraddr1;
			break;
		case UERRADDR0:
			*(uint32_t *)buf = dev->regs.uerraddr0;
			break;
		case RXOVRN_BUF_ADDR:
			*(uint32_t *)buf = dev->regs.rxovrn_buf_addr;
			break;
		case IOLPBKTSTCR:
			*(uint32_t *)buf = dev->regs.iolpbktstcr;
			break;
		case EXTENDED_PRESCALE1:
			*(uint32_t *)buf = dev->regs.extended_prescale1;
			break;
		case EXTENDED_PRESCALE2:
			*(uint32_t *)buf = dev->regs.extended_prescale2;
			break;
		default:
			skyeye_log(Error_log, __FUNCTION__, "Can not read the register at 0x%x in rm48x_spi\n", offset);
			break;
	}
	//printf(" %s\t offset = 0x%x\t value = 0x%x\n",__FUNCTION__,offset,*(uint32_t*)buf);
	return 0;
}

static exception_t rm48x_spi_write(conf_object_t *opaque, generic_address_t offset, void *buf, size_t count)
{
	rm48x_spi_device *dev = opaque->obj;
	uint32_t val = *(uint32_t *)buf;
	uint32_t tmp_spiint0,tmp_spidat1;
	static int offset1 = 0;
	//printf(" %s\t offset = 0x%x\t value = 0x%x\n",__FUNCTION__,offset,val);
	/* support byte access for register */
	if (offset >SPIDAT1 && offset < SPIBUF && count == 1) {
		char *pspidata1 = (char *)&dev->regs.spidat1;
		uint32_t off = offset - SPIDAT1;

		tmp_spidat1 = dev->regs.spidat1;
		*(pspidata1 + off) = val;

		/* deassert cs line, stop translate and receive */
		if ((tmp_spidat1 & (1 << 28)) && ((dev->regs.spidat1 & (1 << 28)) == 0)) {
			deassert_cs_line(opaque);
		}
		return No_exp;
	}
	
	switch (offset)
	{
		case SPIGCR0:
			dev->regs.spigcr0 = val;
			if ((dev->regs.spigcr0 & 0x1) == 1)
			{
				memset(&dev->regs, 0, sizeof(dev->regs));
				dev->regs.spidef = 0xff;
				dev->regs.spiemu = 0x80000000;
				dev->regs.uerrctrl = 0x5;
				dev->regs.uerraddr1 = 0x200;
				dev->regs.rxovrn_buf_addr = 0x200;
				dev->index = 0;
			}
			break;
		case SPIGCR1:
			dev->regs.spigcr1 = val;
			if ((dev->regs.spigcr1 & 0x1000000))
			{
				dev->regs.spidat0 = 0;
				dev->regs.spidat1 &= ~0xff;
				dev->regs.spiflg &= ~(1 << 9);
				dev->regs.spiflg &= ~(1 << 8);
				dev->regs.spiflg &= ~(1 << 6);
				dev->regs.spiflg &= ~(1 << 4);
				dev->regs.spiflg &= ~(1 << 3);
				dev->regs.spiflg &= ~(1 << 2);
				dev->regs.spiflg &= ~(1 << 1);
				dev->regs.spiflg &= ~(1 << 0);
				dev->regs.intvect0 = 0;
				dev->regs.intvect1 = 0;
			}
			if (val == ((dev->regs.spigcr1 & 0xFEFFFFFF) | 0x01000000) && dev->t_flag == 1){
				uint16_t RX_Data[16]  = { 0x1, 0x2, 0x3, 0x4, 0x5, 0x6, 0x7, 0x8, 0x9, 0x8, 0x7, 0x6, 0x5, 0x4, 0x3, 0x2};
				int i;
				for(i = 0; i <16; i++){
					WriteFIFO(dev->spi_fifo, &RX_Data[i], 1);
					
				}
				SET_BIT(dev->regs.spiflg, 0x200);
			}
			break;
		case SPIINT0:
			tmp_spiint0 = dev->regs.spiint0;
			dev->regs.spiint0 = val;
			/* because begin, we should raise signal to active transmit */
			if ((dev->regs.spiint0 & (1 << 9)) && (tmp_spiint0 & (1 << 9)) == 0) {
				RW_WRLOCK(dev->lock);
				dev->regs.spiflg |= 1 << 9;
				dev->regs.intvect1 = 0x14 << 1;
				RW_UNLOCK(dev->lock);
				if (dev->signal_iface != NULL) {
					dev->signal_iface->signal(dev->signal, dev->interrupt_number);
				}
			}
			/* DMA active transmit */
			if ((dev->regs.spiint0 & (1 << 16)) && (tmp_spiint0 & (1 << 16)) == 0) {
				RW_WRLOCK(dev->lock);
				dev->regs.spiflg |= 1 << 9;
				dev->regs.intvect1 = 0x14 << 1;
				RW_UNLOCK(dev->lock);

				if (dev->signal_iface != NULL) {
					dev->signal_iface->signal(dev->signal, dev->interrupt_number);
				}
			}
			/* transmit done */
			if (((dev->regs.spiint0 & (1 << 9)) == 0) && (tmp_spiint0 & (1 << 9))) {
				RW_WRLOCK(dev->lock);
				dev->regs.intvect1 = 0;
				dev->regs.spiflg &= ~(1 << 9);
				RW_UNLOCK(dev->lock);

				notify_transmit_done(opaque);
			}
			/*DMA Mode transmit done */
			if (((dev->regs.spiint0 & (1 << 16)) == 0) && (tmp_spiint0 & (1 << 16))) {
				RW_WRLOCK(dev->lock);
				dev->regs.intvect1 = 0;
				dev->regs.spiflg &= ~(1 << 9);
				RW_UNLOCK(dev->lock);

				notify_transmit_done(opaque);
			}
			/* receive done */
			if (((dev->regs.spiint0 & (1 << 8)) == 0) && (tmp_spiint0 & (1 << 8))) {
				RW_WRLOCK(dev->lock);
				dev->regs.spiflg &= ~(1 << 8);
				dev->regs.intvect1 = 0;
				RW_UNLOCK(dev->lock);
			}
			break;
		case SPILVL:
			dev->regs.spilvl = val;
			break;
		case SPIFLG:
			dev->regs.spiflg &= ~val;
			dev->regs.intvect0 = 0;
			dev->regs.intvect1 = 0;
			break;
		case SPIPC0:
			dev->regs.spipc0 = val;
			break;
		case SPIPC1:
			dev->regs.spipc1 = val;
			break;
		case SPIPC2:
			dev->regs.spipc2 = val;
			break;
		case SPIPC3:
			dev->regs.spipc3 = val;
			break;
		case SPIPC4:
			dev->regs.spipc4 = val;
			break;
		case SPIPC5:
			dev->regs.spipc5 = val;
			break;
		case SPIPC6:
			dev->regs.spipc6 = val;
			break;
		case SPIPC7:
			dev->regs.spipc7 = val;
			break;
		case SPIPC8:
			dev->regs.spipc8 = val;
			break;
		case SPIDAT0:
			dev->regs.spidat0 = val;
			if (dev->regs.spigcr1 & (1 << 24))
			{
				/* enable, now we start transmit */
				start_transmit(opaque, dev->regs.spidat0);
			}
			break;
		case SPIDAT1:
			dev->regs.spidat1 = val;
			SET_BIT(dev->regs.spiflg, 0x100);
			if (dev->regs.spigcr1 & (1 << 24))
			{
				/* enable, now we start transmit */
				start_transmit(opaque, dev->regs.spidat1);
			}
			break;
		case SPIBUF:
			dev->regs.spibuf = val;
			
			break;
		case SPIEMU:
			dev->regs.spiemu = val;
			break;
		case SPIDELAY:
			dev->regs.spidelay = val;
			break;
		case SPIDEF:
			dev->regs.spidef = val;
			//dev->index = get_slave_index(0);
			break;
		case SPIFMT0:
			dev->regs.spifmt0 = val;
			break;
		case SPIFMT1:
			dev->regs.spifmt1 = val;
			break;
		case SPIFMT2:
			dev->regs.spifmt2 = val;
			break;
		case SPIFMT3:
			dev->regs.spifmt3 = val;
			break;
		case INTVECT0:
			dev->regs.intvect0 = val;
			break;
		case INTVECT1:
			dev->regs.intvect1 = val;
			break;
		case SPIPC9:
			dev->regs.spipc9 = val;
			break;
		case SPIPMCTRL:
			dev->regs.spipmctrl = val;
			break;
		case MIBSPIE:
			dev->regs.mibspie = val;
			break;
		case TGITENST:
			dev->regs.tgitenst = val;
			break;
		case TGITENCR:
			dev->regs.tgitencr = val;
			break;
		case TGITLVST:
			dev->regs.tgitlvst = val;
			break;
		case TGITLVCR:
			dev->regs.tgitlvcr = val;
			break;
		case TGINTFLG:
			dev->regs.tgintflg = val;
			break;
		case TICKCNT:
			dev->regs.tickcnt = val;
			break;
		case LTGPEND:
			dev->regs.ltgpend = val;
			break;
		case TGXCTRL:
			dev->regs.tgxctrl = val;
			break;
		case DMAXCTRL:
			dev->regs.dmaxctrl = val;
			break;
		case ICOUNT:
			dev->regs.icount = val;
			break;
		case DMACNTLEN:
			dev->regs.dmacntlen = val;
			break;
		case UERRCTRL:
			 dev->regs.uerrctrl = val;
			break;
		case UERRSTAT:
			dev->regs.uerrstat &= ~val;
			break;
		case UERRADDR1:
			dev->regs.uerraddr1 = val;
			break;
		case UERRADDR0:
			dev->regs.uerraddr0 = val;
			break;
		case RXOVRN_BUF_ADDR:
			dev->regs.rxovrn_buf_addr = val;
			break;
		case IOLPBKTSTCR:
			if (val & (1 << 24) == 1)
				dev->regs.iolpbktstcr &= ~(val & (1 << 24));
			else
				dev->regs.iolpbktstcr = val;
			break;
		case EXTENDED_PRESCALE1:
			dev->regs.extended_prescale1 = val;
			break;
		case EXTENDED_PRESCALE2:
			dev->regs.extended_prescale2 = val;
			break;
		default:
			skyeye_log(Error_log, __FUNCTION__, "Cannot write the register at 0x%x in rm48x_spi\n", offset);
			break;
	}
	return 0;
}

static char* rm48x_spi_get_regname_by_id(conf_object_t *conf_obj, uint32_t id)
{
	return regs_name[id];
}

static exception_t rm48x_spi_set_regvalue_by_id(conf_object_t *conf_obj, uint32_t value, uint32_t id)
{
	rm48x_spi_device *dev = conf_obj->obj;
	struct registers *regs = &(dev->regs);
	*((uint32_t*)regs + id) = value;
	return No_exp;
}

static uint32_t rm48x_spi_get_regnum(conf_object_t *conf_obj)
{
	return sizeof(struct registers) / 4;
}

static uint32_t rm48x_spi_get_regvalue_by_id(conf_object_t *conf_obj, uint32_t id)
{
	rm48x_spi_device *dev = conf_obj->obj;
	struct registers *regs = &(dev->regs);
	uint32_t* regs_value = (uint32_t*)regs + id;
	return *regs_value;
}

