resilencelyn/gitee/open-skyeye/code/device/spiSimulateDevice/rm48x_spi/rm48x_spi.c
static uint32_t rm48x_spi_get_regid_by_name(conf_object_t *conf_obj, char *name)
{
	uint32_t regnum = sizeof(struct registers) / 4, i;
	for(i = 0; i < regnum; i++) {
		if(strcmp(name, regs_name[i]) == 0)
			return i;
	}
	return regnum;
}

static conf_object_t* new_rm48x_spi(const char *obj_name)
{
	rm48x_spi_device* dev = skyeye_mm_zero(sizeof(rm48x_spi_device));
	dev->obj = new_conf_object(obj_name, dev);
	struct registers *regs = &(dev->regs);
	
	dev->regs.spidef = 0xff;
	dev->regs.spiemu = 0x80000000;
	dev->regs.uerrctrl = 0x5;
	dev->regs.uerraddr1 = 0x200;
	dev->regs.rxovrn_buf_addr = 0x200;
	dev->index = 0;
	dev->regs.spibuf = 0x80000000;
	int i;
	for (i = 0; i <= 0x80; i++){
		dev->MibSPI_RAM.RxRAM[i] = 0x80000000;
	}
	dev->spi_fifo = CreateFIFO(1024);
	RWLOCK_INIT(dev->lock);
	return dev->obj;
}

static exception_t free_rm48x_spi(conf_object_t* opaque)
{
	rm48x_spi_device* dev = opaque->obj;
	FreeFIFO(dev->spi_fifo);
	RWLOCK_DESTROY(dev->lock);
	skyeye_free(opaque->objname);
	skyeye_free(opaque->obj);
	skyeye_free(opaque);
	return No_exp;
}

static exception_t config_rm48x_spi(conf_object_t* conf_obj)
{
	rm48x_spi_device *dev = conf_obj->obj;
	int i = 0;
	
	static memory_space_intf io_memory =
	{
		.read  = MibSPI_RAM_read,
		.write = MibSPI_RAM_write
	};
	if (dev->MibSPI_RAM_BASE == 0 )
		return No_exp;
	if (dev->image != NULL) {
	exception_t ret;
	ret = SKY_add_map(dev->image->obj, conf_obj, dev->MibSPI_RAM_BASE, 0x400, 0, &io_memory, 1, 1);
	}else {
		skyeye_log(Error_log, __FUNCTION__, "Cannot get dev->image in rm48x_spi\n");
	}
	
	return No_exp;
}

static exception_t core_signal_set(conf_object_t *obj, conf_object_t *obj2, const char *port, int index)
{
	rm48x_spi_device *dev = obj->obj;
	dev->signal = obj2;
	dev->signal_iface = (core_signal_intf *)SKY_get_iface(dev->signal, CORE_SIGNAL_INTF_NAME);

	if (dev->signal_iface == NULL){
		if (dev->signal == NULL)
		{
			skyeye_log(Error_log, __FUNCTION__, "Can not get %s interface from NULL object fail.", CORE_SIGNAL_INTF_NAME);
		} else
			skyeye_log(Error_log, __FUNCTION__, "Can not get %s interface from %s fail.", CORE_SIGNAL_INTF_NAME, obj2->objname);

		return Not_found_exp;
	}
	return No_exp;
}

static exception_t core_signal_get(conf_object_t *obj, conf_object_t **obj2, const char **port, int index)
{
	rm48x_spi_device *dev = obj->obj;
	*obj2 = dev->signal;
	*port = NULL;
	return No_exp;
}

static exception_t spi_device_set(conf_object_t *obj, conf_object_t *obj2, const char *port, int index)
{
	rm48x_spi_device *dev = obj->obj;
	if (index >= MAX_SLAVES || index < 0)
		return No_exp;

	dev->slaves[index].spi_dev_iface = (spi_device_intf *)SKY_get_iface(obj2, SPI_DEVICE_INTF_NAME);
	dev->slaves[index].slave_obj = obj2;

	if (dev->slaves[index].spi_dev_iface == NULL){
		if (dev->slaves[index].slave_obj == NULL)
		{
			skyeye_log(Error_log, __FUNCTION__, "Can not get %s interface from NULL object fail.", SPI_DEVICE_INTF_NAME);
		} else
			skyeye_log(Error_log, __FUNCTION__, "Can not get %s interface from %s fail.", SPI_DEVICE_INTF_NAME, obj2->objname);

		return Not_found_exp;
	}
	return No_exp;
}

static exception_t spi_device_get(conf_object_t *obj, conf_object_t **obj2, const char **port, int index)
{
	rm48x_spi_device *dev = obj->obj;
	*obj2 = dev->slaves[index].slave_obj;
	return No_exp;
}

static attr_value_t get_attr_int_number(void* arg, conf_object_t* conf_obj, attr_value_t* idx){
	rm48x_spi_device *dev = conf_obj->obj;
	attr_value_t int_number = SKY_make_attr_uinteger(dev->interrupt_number);
	return int_number;
}

static exception_t set_attr_int_number(void* arg, conf_object_t* conf_obj, attr_value_t* value, attr_value_t* idx){
	rm48x_spi_device *dev = conf_obj->obj;
	dev->interrupt_number = SKY_attr_uinteger(*value);
	return No_exp;
}

static attr_value_t get_attr_ram_address(void* arg, conf_object_t* conf_obj, attr_value_t* idx){
	rm48x_spi_device *dev = conf_obj->obj;
	attr_value_t int_number = SKY_make_attr_uinteger(dev->MibSPI_RAM_BASE);
	return int_number;
}

static exception_t set_attr_ram_address(void* arg, conf_object_t* conf_obj, attr_value_t* value, attr_value_t* idx){
	rm48x_spi_device *dev = conf_obj->obj;
	dev->MibSPI_RAM_BASE = SKY_attr_uinteger(*value);
	return No_exp;
}

static attr_value_t get_attr_test_data(void* arg, conf_object_t* conf_obj, attr_value_t* idx){
	rm48x_spi_device *dev = conf_obj->obj;
	attr_value_t t_flag = SKY_make_attr_uinteger(dev->t_flag);
	return t_flag;
}

static exception_t set_attr_test_data(void* arg, conf_object_t* conf_obj, attr_value_t* value, attr_value_t* idx){
	rm48x_spi_device *dev = conf_obj->obj;
	dev->t_flag = SKY_attr_uinteger(*value);
	return No_exp;
}

void rm48x_spi_register_attribute(conf_class_t* clss){
	SKY_register_attribute(clss, "int_number", get_attr_int_number, NULL, set_attr_int_number, NULL, SKY_Attr_Optional, "uinteger", "interrupt number of systimer");
	SKY_register_attribute(clss, "ram_address", get_attr_ram_address, NULL, set_attr_ram_address, NULL, SKY_Attr_Optional, "uinteger", "get ram address for mibspi");
	SKY_register_attribute(clss, "test_data", get_attr_test_data, NULL, set_attr_test_data, NULL, SKY_Attr_Optional, "uinteger", "this is a flag to test");
}

static void spi_bus_receive(void *spi_bus, char *buf, int len)
{
	rm48x_spi_device *dev = ((conf_object_t *)spi_bus)->obj;
	int i = 0;
	if (len > 0) {
		
		for (i = 0; i < len; i++) {
			if ((dev->regs.mibspie) & 0x1 == 1){
				dev->MibSPI_RAM.RxRAM[i] = buf[i];
				dev->MibSPI_RAM.TxRAM[i] = buf[i];
				if (len >= 0x80 && i >= 0x80){
					len = len - 0x80;
					i = 0;
				}
			}
			else
				WriteFIFO(dev->spi_fifo, &buf[i], 1);
			if ((dev->regs.spiint0 & (1 << 8)) || (dev->regs.spiint0 & (1 << 16))) {
				RW_WRLOCK(dev->lock);
				dev->regs.spiflg |= 1 << 8;
				dev->regs.intvect1 = 0x12 << 1;
				RW_UNLOCK(dev->lock);

				if (dev->signal_iface != NULL) {
					dev->signal_iface->signal(dev->signal, dev->interrupt_number);
				}
			}
		}

		return;
	}
	if ((dev->regs.spiint0 & (1 << 8)) && (len == 0)) {
		RW_WRLOCK(dev->lock);
		dev->regs.spiflg |= 1 << 8;
		dev->regs.intvect1 = 0x12 << 1;
		RW_UNLOCK(dev->lock);

		if (dev->signal_iface != NULL) {
			dev->signal_iface->signal(dev->signal, dev->interrupt_number);
		}
	}
}

