resilencelyn/gitee/open-skyeye/code/device/spiSimulateDevice/rm48x_spi/rm48x_spi.c
static exception_t memory_set(conf_object_t *obj, conf_object_t *obj2, const char *port, int index)
{
	rm48x_spi_device *dev = obj->obj;
	dev->image = obj2;
	dev->image_space = (memory_space_intf *)SKY_get_iface(dev->image, MEMORY_SPACE_INTF_NAME);

	if (dev->image_space == NULL){
		if (dev->image == NULL)
		{
			skyeye_log(Error_log, __FUNCTION__, "Can not get %s interface from NULL object fail.", MEMORY_SPACE_INTF_NAME);
		} else
			skyeye_log(Error_log, __FUNCTION__, "Can not get %s interface from %s fail.", MEMORY_SPACE_INTF_NAME, obj2->objname);

		return Not_found_exp;
	}
	return No_exp;
}

static exception_t memory_get(conf_object_t *obj, conf_object_t **obj2, const char **port, int index)
{
	rm48x_spi_device *dev = obj->obj;
	*obj2 = dev->image;
	*port = NULL;
	return No_exp;
}

void init_rm48x_spi(void)
{
	static skyeye_class_t class_data =
	{
		.class_name = "rm48x_spi",
		.class_desc = "rm48x_spi",
		.new_instance = new_rm48x_spi,
		.free_instance = free_rm48x_spi,
		.config_instance = config_rm48x_spi,
	};
	conf_class_t* clss = SKY_register_device_class(class_data.class_name, &class_data);

	static memory_space_intf io_memory =
	{
		.read = rm48x_spi_read,
		.write = rm48x_spi_write
	};
	SKY_register_iface(clss, MEMORY_SPACE_INTF_NAME, &io_memory);

	static skyeye_reg_intf reg_intf =
	{
		.get_regvalue_by_id = rm48x_spi_get_regvalue_by_id,
		.get_regname_by_id = rm48x_spi_get_regname_by_id,
		.set_regvalue_by_id = rm48x_spi_set_regvalue_by_id,
		.get_regnum = rm48x_spi_get_regnum,
		.get_regid_by_name = rm48x_spi_get_regid_by_name
	};
	SKY_register_iface(clss, SKYEYE_REG_INTF, &reg_intf);

	static spi_bus_intf spi_bus_intf = {
		.spi_bus_receive = spi_bus_receive
	};
	SKY_register_iface(clss, SPI_BUS_INTF_NAME, &spi_bus_intf);

	static const struct InterfaceDescription ifaces[] =
	{
		(struct InterfaceDescription)
		{
			.name = MEMORY_SPACE_INTF_NAME,
			.iface = &io_memory
		},
		(struct InterfaceDescription)
		{
			.name = SKYEYE_REG_INTF,
			.iface = &reg_intf
		},
		(struct InterfaceDescription)
		{
			.name = SPI_BUS_INTF_NAME,
			.iface = &spi_bus_intf
		},
	};
	static const struct ConnectDescription connects[] =
	{
		/* ConnectDescription */
		(struct ConnectDescription ){
			.name = CORE_SIGNAL_INTF_NAME,
			.set = core_signal_set,
			.get = core_signal_get,
		},
		(struct ConnectDescription) {
			.name = SPI_DEVICE_INTF_NAME,
			.set = spi_device_set,
			.get = spi_device_get,
		},
		(struct ConnectDescription ){
		.name = MEMORY_SPACE_INTF_NAME,
		.set = memory_set,
		.get = memory_get,
		},
	};
	class_register_ifaces(clss, ifaces);
	class_register_connects(clss, connects);

	rm48x_spi_register_attribute(clss);
}
